MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFM100/mcu.h
extern volatile __C1FIFOCON20bits_t C1FIFOCON20bits __asm__ ("C1FIFOCON20") __attribute__((section("sfrs"), address(0xBF880850)));
extern volatile uint32_t        C1FIFOCON20CLR __attribute__((section("sfrs"),address(0xBF880854)));
extern volatile uint32_t        C1FIFOCON20SET __attribute__((section("sfrs"),address(0xBF880858)));
extern volatile uint32_t        C1FIFOCON20INV __attribute__((section("sfrs"),address(0xBF88085C)));
#define C1FIFOINT20 C1FIFOINT20
extern volatile uint32_t   C1FIFOINT20 __attribute__((section("sfrs"), address(0xBF880860)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT20bits_t;
extern volatile __C1FIFOINT20bits_t C1FIFOINT20bits __asm__ ("C1FIFOINT20") __attribute__((section("sfrs"), address(0xBF880860)));
extern volatile uint32_t        C1FIFOINT20CLR __attribute__((section("sfrs"),address(0xBF880864)));
extern volatile uint32_t        C1FIFOINT20SET __attribute__((section("sfrs"),address(0xBF880868)));
extern volatile uint32_t        C1FIFOINT20INV __attribute__((section("sfrs"),address(0xBF88086C)));
#define C1FIFOUA20 C1FIFOUA20
extern volatile uint32_t   C1FIFOUA20 __attribute__((section("sfrs"), address(0xBF880870)));
extern volatile uint32_t        C1FIFOUA20CLR __attribute__((section("sfrs"),address(0xBF880874)));
extern volatile uint32_t        C1FIFOUA20SET __attribute__((section("sfrs"),address(0xBF880878)));
extern volatile uint32_t        C1FIFOUA20INV __attribute__((section("sfrs"),address(0xBF88087C)));
#define C1FIFOCI20 C1FIFOCI20
extern volatile uint32_t   C1FIFOCI20 __attribute__((section("sfrs"), address(0xBF880880)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI20bits_t;
extern volatile __C1FIFOCI20bits_t C1FIFOCI20bits __asm__ ("C1FIFOCI20") __attribute__((section("sfrs"), address(0xBF880880)));
extern volatile uint32_t        C1FIFOCI20CLR __attribute__((section("sfrs"),address(0xBF880884)));
extern volatile uint32_t        C1FIFOCI20SET __attribute__((section("sfrs"),address(0xBF880888)));
extern volatile uint32_t        C1FIFOCI20INV __attribute__((section("sfrs"),address(0xBF88088C)));
#define C1FIFOCON21 C1FIFOCON21
extern volatile uint32_t   C1FIFOCON21 __attribute__((section("sfrs"), address(0xBF880890)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON21bits_t;
extern volatile __C1FIFOCON21bits_t C1FIFOCON21bits __asm__ ("C1FIFOCON21") __attribute__((section("sfrs"), address(0xBF880890)));
extern volatile uint32_t        C1FIFOCON21CLR __attribute__((section("sfrs"),address(0xBF880894)));
extern volatile uint32_t        C1FIFOCON21SET __attribute__((section("sfrs"),address(0xBF880898)));
extern volatile uint32_t        C1FIFOCON21INV __attribute__((section("sfrs"),address(0xBF88089C)));
#define C1FIFOINT21 C1FIFOINT21
extern volatile uint32_t   C1FIFOINT21 __attribute__((section("sfrs"), address(0xBF8808A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT21bits_t;
extern volatile __C1FIFOINT21bits_t C1FIFOINT21bits __asm__ ("C1FIFOINT21") __attribute__((section("sfrs"), address(0xBF8808A0)));
extern volatile uint32_t        C1FIFOINT21CLR __attribute__((section("sfrs"),address(0xBF8808A4)));
extern volatile uint32_t        C1FIFOINT21SET __attribute__((section("sfrs"),address(0xBF8808A8)));
extern volatile uint32_t        C1FIFOINT21INV __attribute__((section("sfrs"),address(0xBF8808AC)));
#define C1FIFOUA21 C1FIFOUA21
extern volatile uint32_t   C1FIFOUA21 __attribute__((section("sfrs"), address(0xBF8808B0)));
extern volatile uint32_t        C1FIFOUA21CLR __attribute__((section("sfrs"),address(0xBF8808B4)));
extern volatile uint32_t        C1FIFOUA21SET __attribute__((section("sfrs"),address(0xBF8808B8)));
extern volatile uint32_t        C1FIFOUA21INV __attribute__((section("sfrs"),address(0xBF8808BC)));
#define C1FIFOCI21 C1FIFOCI21
extern volatile uint32_t   C1FIFOCI21 __attribute__((section("sfrs"), address(0xBF8808C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI21bits_t;
extern volatile __C1FIFOCI21bits_t C1FIFOCI21bits __asm__ ("C1FIFOCI21") __attribute__((section("sfrs"), address(0xBF8808C0)));
extern volatile uint32_t        C1FIFOCI21CLR __attribute__((section("sfrs"),address(0xBF8808C4)));
extern volatile uint32_t        C1FIFOCI21SET __attribute__((section("sfrs"),address(0xBF8808C8)));
extern volatile uint32_t        C1FIFOCI21INV __attribute__((section("sfrs"),address(0xBF8808CC)));
#define C1FIFOCON22 C1FIFOCON22
extern volatile uint32_t   C1FIFOCON22 __attribute__((section("sfrs"), address(0xBF8808D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON22bits_t;
extern volatile __C1FIFOCON22bits_t C1FIFOCON22bits __asm__ ("C1FIFOCON22") __attribute__((section("sfrs"), address(0xBF8808D0)));
extern volatile uint32_t        C1FIFOCON22CLR __attribute__((section("sfrs"),address(0xBF8808D4)));
extern volatile uint32_t        C1FIFOCON22SET __attribute__((section("sfrs"),address(0xBF8808D8)));
extern volatile uint32_t        C1FIFOCON22INV __attribute__((section("sfrs"),address(0xBF8808DC)));
#define C1FIFOINT22 C1FIFOINT22
extern volatile uint32_t   C1FIFOINT22 __attribute__((section("sfrs"), address(0xBF8808E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT22bits_t;
extern volatile __C1FIFOINT22bits_t C1FIFOINT22bits __asm__ ("C1FIFOINT22") __attribute__((section("sfrs"), address(0xBF8808E0)));
extern volatile uint32_t        C1FIFOINT22CLR __attribute__((section("sfrs"),address(0xBF8808E4)));
extern volatile uint32_t        C1FIFOINT22SET __attribute__((section("sfrs"),address(0xBF8808E8)));
extern volatile uint32_t        C1FIFOINT22INV __attribute__((section("sfrs"),address(0xBF8808EC)));
#define C1FIFOUA22 C1FIFOUA22
extern volatile uint32_t   C1FIFOUA22 __attribute__((section("sfrs"), address(0xBF8808F0)));
extern volatile uint32_t        C1FIFOUA22CLR __attribute__((section("sfrs"),address(0xBF8808F4)));
extern volatile uint32_t        C1FIFOUA22SET __attribute__((section("sfrs"),address(0xBF8808F8)));
extern volatile uint32_t        C1FIFOUA22INV __attribute__((section("sfrs"),address(0xBF8808FC)));
#define C1FIFOCI22 C1FIFOCI22
extern volatile uint32_t   C1FIFOCI22 __attribute__((section("sfrs"), address(0xBF880900)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI22bits_t;
